In [44]:
import re
import pandas as pd

# Basic data cleaning.

In [45]:
def search_nanull(data: pd.DataFrame) -> list:
    result = []
    for col in data.columns:
        result.append(data[col].isna().unique() +
                      data[col].isnull().unique())
    return result

In [46]:
def string_to_int(data: pd.DataFrame, 
                  cols: dict) -> pd.DataFrame:
    """convert cols (cols.keys()) in new_cols (cols.values())
    of data and drop the oldones
    Args:
        data: DataFreme to add new columns
        cols: names of the old and new columns
    Returns:
        DataFrame with changes
    """
    categorical2int = lambda x: int(''.join(re.findall('\d*',x)))

    for col, new_col in zip(cols.keys(), cols.values()):
        data[new_col] = data[col].apply(categorical2int)
        data = data.drop(col, axis=1)

    return data

## Dataclean tests

In [5]:
categorical2int = lambda x: int(''.join(re.findall('\d*',x)))

In [6]:
dataset1 = pd.read_csv('data/Input1_clientes_estructura.csv', sep=';')

In [7]:
dataset1.sample(10)

       Cliente   Regional2    Gerencia2    SubCanal2    Categoria  Nevera
14102    14103  Regional 1   Gerencia_2   Subcanal_4  Categoria_3       1
13201    13202  Regional 1   Gerencia_5   Subcanal_2  Categoria_2       0
12763    12764  Regional 1  Gerencia_10   Subcanal_8  Categoria_4       1
13427    13428  Regional 1   Gerencia_9   Subcanal_3  Categoria_3       1
2892      2893  Regional 1   Gerencia_9   Subcanal_3  Categoria_3       0
12514    12515  Regional 1   Gerencia_3   Subcanal_4  Categoria_3       0
19829    19830  Regional 1   Gerencia_6   Subcanal_1  Categoria_2       0
19463    19464  Regional 1   Gerencia_6  Subcanal_31  Categoria_2       0
57          58  Regional 1   Gerencia_2   Subcanal_2  Categoria_2       1
7645      7646  Regional 1   Gerencia_2   Subcanal_3  Categoria_2       1

In [8]:
print(dataset1.dtypes)
dataset1.describe(exclude="int64")

Cliente       int64
Regional2    object
Gerencia2    object
SubCanal2    object
Categoria    object
Nevera        int64
dtype: object

         Regional2    Gerencia2   SubCanal2    Categoria
count        20921        20921       20921        20921
unique           1           11          32            6
top     Regional 1  Gerencia_10  Subcanal_3  Categoria_2
freq         20921         5441        8217         8773

In [9]:
dataset1.describe(include="int64")

            Cliente        Nevera
count  20921.000000  20921.000000
mean   10461.000000      0.397830
std     6039.516827      0.489462
min        1.000000      0.000000
25%     5231.000000      0.000000
50%    10461.000000      0.000000
75%    15691.000000      1.000000
max    20921.000000      1.000000

In [10]:
dataset1 = dataset1.drop('Regional2', axis=1)

In [11]:
any(search_nanull(dataset1))

False

In [12]:
cols = {'Gerencia2': 'Distribuidor', 
        'SubCanal2': 'Tipo', 'Categoria':'Category'}
for col, new_col in zip(cols.keys(), cols.values()):
    print(new_col)
    dataset1[new_col] = dataset1[col].apply(categorical2int)
    dataset1 = dataset1.drop(col, axis=1)

Distribuidor
Tipo
Category

In [13]:
cols_structure = {'Category': 'Categoria'}
dataset1 = dataset1.rename(columns=cols_structure)

In [14]:
dataset1

       Cliente  Nevera  Distribuidor  Tipo  Categoria
0            1       0             1     1          1
1            2       0             1     1          1
2            3       0             1     1          1
3            4       1             1     1          1
4            5       1             1     1          2
...        ...     ...           ...   ...        ...
20916    20917       0             1    31          2
20917    20918       0             4    31          1
20918    20919       0             9    31          1
20919    20920       0            10    31          1
20920    20921       0             9    31          1

[20921 rows x 5 columns]

In [15]:
dataset2 = pd.read_csv('data/Input2_clientes_venta.csv', sep=';')

In [16]:
dataset2.sample(10)

,Año,Mes,Cliente,SegmentoPrecio2,Marca2,Cupo2,CapacidadEnvase2,Volumen,disc,nr
1398419,2020,7,9768,SegmentoPrecio_3,Marca_39,Cupo_2,CapacidadEnvase_10,0.000000,0.000000,0.000000
552737,2020,3,4630,SegmentoPrecio_1,Marca_1,Cupo_2,CapacidadEnvase_10,0.217344,-30.710468,1766.732553
1060439,2019,10,2503,SegmentoPrecio_2,Marca_6,Cupo_1,CapacidadEnvase_10,0.017388,0.000000,186.072880
170256,2020,8,7169,SegmentoPrecio_2,Marca_6,Cupo_2,CapacidadEnvase_10,0.130406,-146.405698,1177.711683
730659,2020,2,9450,SegmentoPrecio_1,Marca_1,Cupo_2,CapacidadEnvase_16,0.026345,-31.756018,137.744589
91181,2019,12,3947,SegmentoPrecio_1,Marca_5,Cupo_1,CapacidadEnvase_10,0.034775,0.000000,337.972339
1128887,2020,9,3202,SegmentoPrecio_3,Marca_9,Cupo_3,CapacidadEnvase_12,0.004676,0.000000,83.565758
1056696,2019,11,5000,SegmentoPrecio_1,Marca_1,Cupo_2,CapacidadEnvase_10,0.086938,0.000000,700.918949
369713,2020,8,18868,SegmentoPrecio_1,Marca_20,Cupo_3,CapacidadEnvase_9,0.033721,0.000000,210.940205
268098,2020,2,11705,SegmentoPrecio_2,Marca_16,Cupo_2,CapacidadEnvase_10,0.021734,-13.922261,206.710523

In [17]:
print(dataset2.dtypes)
dataset2.describe(exclude=['int64','float64'])

Año                   int64
Mes                   int64
Cliente               int64
SegmentoPrecio2      object
Marca2               object
Cupo2                object
CapacidadEnvase2     object
Volumen             float64
disc                float64
nr                  float64
dtype: object

         SegmentoPrecio2   Marca2    Cupo2    CapacidadEnvase2
count            1406116  1406116  1406116             1406116
unique                 3       39        5                  17
top     SegmentoPrecio_1  Marca_1   Cupo_2  CapacidadEnvase_10
freq              991679   406526   786172              707919

In [18]:
dataset2 = dataset2.drop(['Año', 'Mes'], axis=1)

In [19]:
any(search_nanull(dataset2))

False

In [20]:
cols = {'CapacidadEnvase2':'CapacidadEnvase', 
        'SegmentoPrecio2':'CategoriaMarca',
        'Marca2':'Marca', 'Cupo2':'Envase'}
for col, new_col in zip(cols.keys(), cols.values()):
    print(new_col)
    dataset2[new_col] = dataset2[col].apply(categorical2int)
    dataset2 = dataset2.drop(col, axis=1)

CapacidadEnvase
CategoriaMarca
Marca
Envase

In [21]:
dataset2.head(10)

,Cliente,Volumen,disc,nr,CapacidadEnvase,CategoriaMarca,Marca,Envase
0,10,0.112229,-30.590603,900.328567,12,1,1,1
1,10,0.021734,0.000000,149.184463,10,1,2,2
2,10,0.043469,0.000000,359.625828,10,2,3,2
3,10,0.026345,-31.065261,134.748399,16,1,1,2
4,10,0.086938,0.000000,496.901005,10,1,4,2
5,10,0.369485,-114.891895,2853.911219,10,1,1,2
6,10,0.825907,-221.071444,6153.614786,10,1,5,2
7,10,0.036630,0.000000,303.759828,12,1,1,1
8,10,0.043469,0.000000,358.300464,10,2,6,2
9,10,0.004347,0.000000,43.469689,10,2,6,1

In [22]:
cols_structure = {'disc': 'Descuento', 'nr': 'IngresoNeto'}
dataset2 = dataset2.rename(columns=cols_structure)

In [23]:
dataset2

,Cliente,Volumen,Descuento,IngresoNeto,CapacidadEnvase,CategoriaMarca,Marca,Envase
0,10,0.112229,-30.590603,900.328567,12,1,1,1
1,10,0.021734,0.000000,149.184463,10,1,2,2
2,10,0.043469,0.000000,359.625828,10,2,3,2
3,10,0.026345,-31.065261,134.748399,16,1,1,2
4,10,0.086938,0.000000,496.901005,10,1,4,2
...,...,...,...,...,...,...,...,...
1406111,20577,0.039122,0.000000,544.150314,10,3,39,2
1406112,20580,0.000000,0.000000,0.000000,10,1,38,2
1406113,20580,0.058683,0.000000,759.218996,10,3,39,2
1406114,20580,0.000000,0.000000,0.000000,10,1,38,2
1406115,20580,0.019561,0.000000,269.150196,10,3,39,2

In [24]:
dataset2[dataset2['IngresoNeto'] <= 0]

,Cliente,Volumen,Descuento,IngresoNeto,CapacidadEnvase,CategoriaMarca,Marca,Envase
725145,9299,0.028540,0.0,0.0,17,1,1,2
910771,14481,0.021734,0.0,0.0,10,1,1,2
1387941,212,0.000000,0.0,0.0,10,3,39,2
1387949,591,0.000000,0.0,0.0,10,3,39,2
1387951,614,0.000000,0.0,0.0,10,3,39,2
...,...,...,...,...,...,...,...,...
1406103,20529,0.000000,0.0,0.0,10,3,39,2
1406105,20529,0.000000,0.0,0.0,10,3,39,2
1406108,20569,0.000000,0.0,0.0,10,1,38,2
1406112,20580,0.000000,0.0,0.0,10,1,38,2
1406114,20580,0.000000,0.0,0.0,10,1,38,2

In [25]:
dataset2[dataset2['Volumen'] <= 0]

,Cliente,Volumen,Descuento,IngresoNeto,CapacidadEnvase,CategoriaMarca,Marca,Envase
1387941,212,0.0,0.0,0.0,10,3,39,2
1387949,591,0.0,0.0,0.0,10,3,39,2
1387951,614,0.0,0.0,0.0,10,3,39,2
1387953,614,0.0,0.0,0.0,10,3,39,2
1387973,1006,0.0,0.0,0.0,10,3,39,2
...,...,...,...,...,...,...,...,...
1406103,20529,0.0,0.0,0.0,10,3,39,2
1406105,20529,0.0,0.0,0.0,10,3,39,2
1406108,20569,0.0,0.0,0.0,10,1,38,2
1406112,20580,0.0,0.0,0.0,10,1,38,2
1406114,20580,0.0,0.0,0.0,10,1,38,2

In [26]:
dataset2 = dataset2.merge(dataset1)
dataset2.sample(10)

,Cliente,Volumen,Descuento,IngresoNeto,CapacidadEnvase,CategoriaMarca,Marca,Envase,Nevera,Distribuidor,Tipo,Categoria
583639,5343,0.034775,0.000000,267.562003,10,1,2,1,1,10,3,2
508480,3870,0.079034,0.000000,507.180433,16,1,1,2,0,10,3,3
82069,3677,0.474205,-56.193408,2984.229848,16,1,5,2,0,10,3,2
1372249,12728,0.412954,-109.470462,3129.863074,10,1,5,2,1,2,4,3
746010,9615,0.149533,0.000000,1123.273962,14,1,1,1,1,10,1,2
736359,9372,1.651815,-528.925629,12757.900729,10,1,1,2,1,10,5,1
1045343,5360,0.018705,0.000000,157.412213,12,1,1,1,1,10,11,2
783748,10652,0.026345,-31.623399,137.598057,16,1,1,2,1,3,3,2
648175,7172,0.023052,0.000000,178.911053,11,1,15,2,1,2,4,2
570979,5020,0.043469,-45.034784,387.720958,10,2,6,2,1,6,3,3

In [27]:
dataset2['Nevera'] = dataset2['Nevera'].astype('bool')
category_cols = ['CapacidadEnvase','CategoriaMarca', 'Marca', 'Envase', 'Distribuidor', 'Tipo', 'Categoria']
for col in category_cols:
    dataset2[col] = dataset2[col].astype('category')

In [28]:
dataset2.describe(include=['category','bool'])

,CapacidadEnvase,CategoriaMarca,Marca,Envase,Nevera,Distribuidor,Tipo,Categoria
count,1406116,1406116,1406116,1406116,1406116,1406116,1406116,1406116
unique,17,3,39,5,2,11,27,6
top,10,1,1,2,True,10,3,2
freq,707919,991679,406526,786172,866769,470904,567541,586357

## Data clean block

In [107]:
# All dataclean process for now
# read
dataset1 = pd.read_csv('data/Input1_clientes_estructura.csv', sep=';')
dataset2 = pd.read_csv('data/Input2_clientes_venta.csv', sep=';')

# string data to int
dataset1 = dataset1.drop('Regional2', axis=1)
cols_dataset1 = {'Gerencia2': 'Distribuidor', 
        'SubCanal2': 'Tipo', 'Categoria':'Category'}
dataset1 = string_to_int(dataset1, cols_dataset1)

# dataset2 = dataset2.drop(['Año', 'Mes'], axis=1)
cols_dataset2 = {'CapacidadEnvase2':'CapacidadEnvase', 
        'SegmentoPrecio2':'CategoriaMarca',
        'Marca2':'Marca', 'Cupo2':'Envase'}
dataset2 = string_to_int(dataset2, cols_dataset2)

# Rename columns
cols_structure = {'Category': 'Categoria'}
dataset1 = dataset1.rename(columns=cols_structure)

cols_sell = {'disc': 'Descuento', 'nr': 'IngresoNeto'}
dataset2 = dataset2.rename(columns=cols_sell)

# merge data
dataset = dataset2.merge(dataset1)

# corret dtypes in dataset
dataset['Nevera'] = dataset['Nevera'].astype('bool')
dataset = dataset.drop(dataset[(dataset['Volumen'] > 0) & (dataset['IngresoNeto'] <= 0)].sort_values('IngresoNeto').index)
category_cols = ['CapacidadEnvase','CategoriaMarca', 'Marca',
                 'Envase', 'Distribuidor', 'Tipo', 'Categoria']

for col in category_cols:
    dataset[col] = dataset[col].astype('category')

# Search for NA or NULL data
msg = "Some data have na or null values"
assert not any(search_nanull(dataset)), msg

In [108]:
dataset.dtypes

Año                   int64
Mes                   int64
Cliente               int64
Volumen             float64
Descuento           float64
IngresoNeto         float64
CapacidadEnvase    category
CategoriaMarca     category
Marca              category
Envase             category
Nevera                 bool
Distribuidor       category
Tipo               category
Categoria          category
dtype: object

In [109]:
dataset.describe(include=['category','bool'])

,CapacidadEnvase,CategoriaMarca,Marca,Envase,Nevera,Distribuidor,Tipo,Categoria
count,1406114,1406114,1406114,1406114,1406114,1406114,1406114,1406114
unique,17,3,39,5,2,11,27,6
top,10,1,1,2,True,10,3,2
freq,707918,991677,406524,786170,866767,470903,567540,586357

In [110]:
dataset.describe()

,Año,Mes,Cliente,Volumen,Descuento,IngresoNeto
count,1.406114e+06,1.406114e+06,1.406114e+06,1.406114e+06,1.406114e+06,1.406114e+06
mean,2.019518e+03,6.865559e+00,8.328059e+03,2.294366e-01,-1.335857e+02,1.704836e+03
std,4.996729e-01,2.996954e+00,4.906401e+03,1.395799e+00,1.491834e+03,1.047080e+04
min,2.019000e+03,1.000000e+00,1.000000e+00,0.000000e+00,-4.794567e+05,0.000000e+00
25%,2.019000e+03,5.000000e+00,4.148000e+03,2.173441e-02,-2.877037e+01,1.778085e+02
50%,2.020000e+03,7.000000e+00,8.097000e+03,5.268947e-02,0.000000e+00,4.233222e+02
75%,2.020000e+03,9.000000e+00,1.231800e+04,1.496381e-01,0.000000e+00,1.117963e+03
max,2.020000e+03,1.200000e+01,2.058000e+04,3.000000e+02,0.000000e+00,2.302965e+06

In [111]:
dataset[(dataset['Volumen'] > 0) & (dataset['IngresoNeto'] <= 0)].sort_values('IngresoNeto')

Empty DataFrame
Columns: [Año, Mes, Cliente, Volumen, Descuento, IngresoNeto, CapacidadEnvase, CategoriaMarca, Marca, Envase, Nevera, Distribuidor, Tipo, Categoria]
Index: []

In [112]:
dataset[(dataset['Volumen'] == 0) & (dataset['IngresoNeto'] == 0)].sort_values('IngresoNeto')

,Año,Mes,Cliente,Volumen,Descuento,IngresoNeto,CapacidadEnvase,CategoriaMarca,Marca,Envase,Nevera,Distribuidor,Tipo,Categoria
3645,2020,8,212,0.0,0.0,0.0,10,3,39,2,True,4,13,3
858514,2020,7,12653,0.0,0.0,0.0,10,3,39,2,True,8,5,3
858299,2020,8,12648,0.0,0.0,0.0,10,3,39,2,False,10,6,2
858246,2020,7,12645,0.0,0.0,0.0,10,3,39,2,True,10,3,6
858079,2020,9,12644,0.0,0.0,0.0,10,3,39,2,False,10,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
567637,2020,9,4918,0.0,0.0,0.0,10,1,38,2,False,6,3,3
567532,2020,7,4916,0.0,0.0,0.0,10,1,38,2,False,10,3,2
567394,2020,9,4914,0.0,0.0,0.0,10,3,39,2,False,10,3,1
568036,2020,8,4926,0.0,0.0,0.0,10,3,39,2,True,6,5,3
1406114,2020,9,20580,0.0,0.0,0.0,10,1,38,2,False,10,5,6

In [113]:
# volar datos inútiles
dataset = dataset.drop(dataset[(dataset['Volumen'] > 0) & (dataset['IngresoNeto'] <= 0)].sort_values('IngresoNeto').index)
dataset = dataset.drop(dataset[(dataset['Volumen'] == 0) & (dataset['IngresoNeto'] == 0)].sort_values('IngresoNeto').index)

In [114]:
dataset[(dataset['Volumen'] > 0) & (dataset['IngresoNeto'] <= 0)].sort_values('IngresoNeto')

Empty DataFrame
Columns: [Año, Mes, Cliente, Volumen, Descuento, IngresoNeto, CapacidadEnvase, CategoriaMarca, Marca, Envase, Nevera, Distribuidor, Tipo, Categoria]
Index: []

# Some relations and gruops of data.

In [115]:
dataset.groupby('Distribuidor').agg({'Cliente':'count'})

              Cliente
Distribuidor
1              103202
2               78774
3              122040
4               89215
5                   2
6              201293
7                 799
8              224947
9              112509
10             468166
11                134

In [116]:
filter_data = dataset.query('(Marca == 20 and Envase == 3 and CapacidadEnvase == 9) \
                            or (Marca == 16 and Envase == 2 and CapacidadEnvase == 10)\
                            or (Marca == 9 and Envase == 3 and CapacidadEnvase == 12)\
                            or (Marca == 38 and Envase == 2 and CapacidadEnvase == 10)\
                            or (Marca == 39 and Envase == 2 and CapacidadEnvase == 10)').index
dataset['Usefull'] = dataset.index.isin(filter_data)

In [117]:
dataset['date'] = dataset['Año'].astype('str') + '-' + dataset['Mes'].astype('str')
dataset['date'] = pd.to_datetime(dataset['date'], format='%Y-%m')
dataset = dataset.drop(['Año', 'Mes'], axis=1)

In [130]:
dataset.groupby('Marca').agg({'Volumen':'sum', 'IngresoNeto': 'sum'}).sort_values('Volumen', ascending=False)

             Volumen   IngresoNeto
Marca
1      143759.319687  1.008800e+09
5       75625.310888  5.731430e+08
4       59327.260060  3.794122e+08
6       12802.850542  1.182211e+08
9        6235.730891  9.975467e+07
15       5451.102242  4.122032e+07
7        4977.753604  5.114611e+07
38       2490.172854  1.535347e+07
3        1987.549722  1.809718e+07
8        1569.168044  1.280323e+07
2        1505.038540  1.162772e+07
16       1358.088795  1.324326e+07
12        931.712100  9.006453e+06
17        889.568934  6.260668e+06
20        714.975392  4.832522e+06
39        668.310346  9.243934e+06
10        552.513529  4.285182e+06
11        386.766579  6.243558e+06
14        261.994252  2.709743e+06
22        215.386093  1.243912e+06
24        194.649977  3.391539e+06
13        113.689778  1.092929e+06
18        101.650366  5.886861e+05
19         86.346888  6.911223e+05
32         85.250352  8.806318e+05
29         61.585426  5.719588e+05
23         58.365746  6.390469e+05
30         51.835833  5.566070e+05
25         44.141858  9.124469e+05
37         40.938729  2.446891e+05
26         25.177135  2.862063e+05
28         12.722465  2.629711e+05
27         12.074911  1.914226e+05
31          6.739839  1.395832e+05
36          4.150547  3.341446e+04
21          1.925668  1.589668e+04
35          1.706875  3.569494e+04
34          0.269507  6.829614e+03
33          0.153590  4.020873e+03